package com.nantian.npbs.gateway.camel.processor;

import com.nantian.npbs.packet.ControlMessage;

public class TuxStringTest {

	public static String backPacket(ControlMessage cm) {

		String responseDataString = "";

		if (cm.getTranCode().equals("003001")) { // IC卡
			responseDataString = "000000||20111031|368|00001|0340123474|孙永强|河北省石家庄市开发区珠峰大街180号22#楼1单元901|13401|02|0|0|0|0.00|0.39|0|01|0|0|0|0|0001非普不满1KV|80.44|";
		} else if (cm.getTranCode().equals("003001")) { // 电信查询
			responseDataString = "000000||20111031|368|00001|孙永强|100|80.44|";
		} else if (cm.getTranCode().equals("003002")) { // 电信缴费
			responseDataString = "000000||20111031|368|00001|13483571178|孙永强|1234567890|01-12|100|80.44|12|13|44|22|58|1|2|3|4|5|6|7|8|9|10|11|";
		} else if (cm.getTranCode().equals("001001")) { // 移动查询
			responseDataString = "000000||20111031|368|00001|孙永强|100|80.44|";
		} else if (cm.getTranCode().equals("001002")) { // 移动缴费
			responseDataString = "000000||20120221|130000763|00001|1|210859|神州行|张永录|18733243127|130000763|31288159651583256|20.00|20120221|                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                       |计费金额合计：0"
					+ ".00        当前月话费：24.71         |最新余额：22.18           |协议款剩余：0.00          协议款消费：0.00          | |0.00        |";
		} else if (cm.getTranCode().equals("005002")) { // 邯郸缴费
			responseDataString = "000000||20120221|130052473|000199131000_PG01_1313250|1|0.30|201201|";
		} else if (cm.getTranCode().equals("009001")) { // 有线电视查询
			responseDataString = "000000||20120228|130003578|00001|010200001234|1869658937|02|||1869658937|1231.00|";
		} else if (cm.getTranCode().equals("009002")) { // 有线电视缴费
			responseDataString = "000000||20120228|130003579|000199131100_PG01_1316010|1|130003579|";
		} else if (cm.getTranCode().equals("010001")) { // 省标查询
			responseDataString = "000000||20120216|0|00001|0340123474|孙永强|河北省石家庄市开发区珠峰大街180号22#楼1单元901|13401|02|0|0|0|0.00|0.52|0|01|0|0|0|0|0001非普不满1KV|80.44|";
		} else if (cm.getTranCode().equals("010002")) { // 省标缴费
			responseDataString = "000000||20120227|130003511|00001|E8B5692C9B60ACAE|1000|YZD10220120227130003511|";
		} else if (cm.getTranCode().equals("010003")) { // 省标正常申请写卡数据
			responseDataString = "000000||20120227|130003511|00001|68014B01000000000076788930088813000000000000000005140000003940420F000000000000000000000000000000000000000000D00700000000000000000000000000594216270212010000F216B33DFB4E      |";
		} else if (cm.getTranCode().equals("010004")) { // 省标补写卡
			responseDataString = "000000||20120228|130003579|000199131100_PG01_1316010|1|130003579|";
		} else if (cm.getTranCode().equals("010023")) { // 省标补写卡数据申请
			responseDataString = "000000||20120228|130003579|000199131100_PG01_1316010|1|130003579|";
		} else if (cm.getTranCode().equals("010012")) { // 省标撤销写卡
			responseDataString = "000000||20120228|130003579|000199131100_PG01_1316010|1|130003579|";
		} else if (cm.getTranCode().equals("010024")) { // 省标撤销写卡脚本申请
			responseDataString = "000000||20120419|130019248|00001|04D681005468014B014734240000001903000088130000000000000000006400000006102700000000000000000000000000000000000000000000E803000000000000000000000000002350091904120100008F16A635C19E      |";
		} else if (cm.getTranCode().equals("006002")) { // 保定水费
			responseDataString = "000000||20120223|130084003|00001|10092|0000000000000000ｌ[1m^G7|20111210|20120210|12.60|5.60|0.70|0.30|0.40|1.80|0.80|0.10|197|";
		} else if (cm.getTranCode().equals("000012")) { // 移动缴费
			responseDataString = "000000||20120221|130000763|00001|1|210859|神州行|张永录|18733243127|130000763|31288159651583256|20.00|20120221|                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                       |计费金额合计：0"
					+ ".00        当前月话费：24.71         |最新余额：22.18           |协议款剩余：0.00          协议款消费：0.00          | |0.00        |";
		} else if (cm.getTranCode().equals("014002")) { // 缴费
			responseDataString = "000000||20120224|130044987|00001|1|121155|神州行|唐建军|15933663322|130044987|31488159830066238|10.00|20120224|                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                                                 |                       |计费金额合计：0.00        当前月话费：29.89         |最新余额：31.28           |协议款剩余：0.00          协议款消费：0.00          | |0.00        |";
		}else if (cm.getTranCode().equals("012001")) { // 河电国标卡查询
			responseDataString = "000000||20120228|0|00001|0275317386|杜立峰|东三教大街华城绿洲小区3-3-1503|01|0.00|0.00|13401|02|0.00|0.00|";
		}else if (cm.getTranCode().equals("012002")) { // 河电国标卡缴费
			responseDataString = "000000||20120228|130000763|00001|130000763|11111111|22222222|999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999|88888888|7777777777777777|";
		}else if(cm.getTranCode().equals("012012")) { //河电国标卡撤销
			responseDataString = "000000||20120306|130004012|00001|0000000000000000|8A3DE3FE|D188614E|130004012| ";			
		}else if(cm.getTranCode().equals("008001")) { //现金新奥燃气查询
			return "000000||20120314|0|00001|马春凤|名门华都001栋01单元08020|820.00||";
			
		}else if(cm.getTranCode().equals("008002")) { //现金新奥燃气缴费
			return "000000||20120314|130017670|000199131100_PG01_1313220|1|830.00|20120314000130017670 ";
		} else if (cm.getTranCode().equals("014001")) {
			responseDataString = "000000||20120317|0|00001|1510403480|王耀华|承德市丰宁县石人沟乡石人沟村石人沟北变台|51.16|134050807|1|@2012000117130084@51.16@0.00@|";
		}else if (cm.getTranCode().equals("007002")) {
			responseDataString = "000000||20120322|130081053|000199131109_PG01_1313060|1|45.00|6105.00 - 6522.00|";
		}else if (cm.getTranCode().equals("007001")) {
			responseDataString = "000000||20120322|0|00001|王国中|小吴村村内06|216.84|216.84|0.00|0.00|1|0301276063      465602170       216.84             |";
		}else if (cm.getTranCode().equals("000010")) {
			responseDataString = "000000||20120327|0|00001|1|20120327|105442|130051948|47.580000|";
		}else if(cm.getTranCode().equals("011001")) {
			responseDataString="000000||20120419|130019328|00001|01|仝同|石家庄珠峰大街水榭花都10栋1单元301|50|2.40|0.00|12|28.80|";
		}else if(cm.getTranCode().equals("011002")) {
			responseDataString="000000||20121210|130022940|000120121210130022940|1|B0F86FF2D82AF43D424C25879DF346A95119401B8BF54D5E691E7FC2F7ECC898827A1C37AEBA485A5221214B2CAA2198827A1C37AEBA485A3B9B6CF0B4217DDC|000000022400000001000000022400|";
		}else if(cm.getTranCode().equals("011012")) {
			responseDataString="000000||20120327|0|00001|";
		}else if(cm.getTranCode().equals("010026")) {
			responseDataString="000000||20120419|130019248|00001|7F1DEE6EB3F5DE14|YZD10220120419130019248|4|";
		}else if(cm.getTranCode().equals("011027")){
			responseDataString="000000||20120327|0|00001|";
			
		}//011027

		

		return responseDataString;
	}
}
